#+PROPERTY: header-args:sage :session result

#+BEGIN_SRC sage :exports none
  from e8theta_degree3.hecke_module import (HalfIntMatElement, HeckeModule,
                                            spinor_l_euler_factor, rankin_convolution_degree1)
  from e8theta_degree3.gl3_repn import gl3_repn_module
  from e8theta_degree3.results.data.data_utils import (data_dir, half_int_mat_to_list, sort_ts,
                                                       dict_sum, gcd_of_dict_vals, modulo_p)

  T0 = HalfIntMatElement(matrix([[1, 1 / 2, 1 / 2], [1 / 2, 1, 1 / 2], [1 / 2, 1 / 2, 1]]))
  T1 = HalfIntMatElement(diagonal_matrix([1, 1, 1]))
  i = QuadraticField(-1, name="i").gen()
#+END_SRC

#+RESULTS:

* Polynomial representation
  The dimension of the polynomial representation of weight =(18, 17, 5)= is =195=.
  We sort SSYT of weight =(13, 12, 0)= as in [[file:SSYT.org][this file]].

* Basis of the space of cusp forms

#+BEGIN_SRC sage :exports none
  dicts = load(os.path.join(data_dir(), "wt18_17_5_dicts.sobj"))
  S18_17_5 = HeckeModule(dicts, lin_indep_ts=[T0, T1])
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sage :exports none
  mat0 = matrix(3, [-5, -3*i, 4, 6*i, -2, 0, 0, 0, 3, 5*i, 2, 0, 4, 2*i,
                    0, 0, 0, 6*i, 3, 3*i, 6, 0, 0, 0])
  mat1 = matrix(3, [-7, -5*i, 6, 8*i, -2, 0, 0, 0, -8, -6*i, -3, i, 0, 6*i, 0, 0,
                    -26, -10*i, -25, i, -13, 37*i, 0, 0])
  mat2 = matrix(3, [-6, -4*i, 5, 7*i, -2, 0, 0, 0, -11, -9*i, 0, 4*i, 1, 5*i, 0, 0,
                    -27, -43*i, 20, 4*i, 31, -15*i, 0, 0])
#+END_SRC

#+RESULTS:

Let =Theta0=, =Theta1= and =Theta2= are theta series of weight =(18, 17, 5)=
associated with the following three matrices respectively. Then =Theta0=,
=Theta1= and =Theta2= spans the space of cusp forms.

#+BEGIN_SRC sage  :exports results
  print mat0
#+END_SRC

#+RESULTS:
: [  -5 -3*i    4  6*i   -2    0    0    0]
: [   3  5*i    2    0    4  2*i    0    0]
: [   0  6*i    3  3*i    6    0    0    0]

#+BEGIN_SRC sage  :exports results
  print mat1
#+END_SRC

#+RESULTS:
: [   -7  -5*i     6   8*i    -2     0     0     0]
: [   -8  -6*i    -3     i     0   6*i     0     0]
: [  -26 -10*i   -25     i   -13  37*i     0     0]

#+BEGIN_SRC sage :exports results
  print mat2
#+END_SRC

#+RESULTS:
: [   -6  -4*i     5   7*i    -2     0     0     0]
: [  -11  -9*i     0   4*i     1   5*i     0     0]
: [  -27 -43*i    20   4*i    31 -15*i     0     0]

#+BEGIN_SRC sage :exports none
  gcd_of_dict_vals(S18_17_5.basis[0]).factor()
#+END_SRC

#+RESULTS:
: 2^20 * 3^5 * 5 * 7

Fourier coefficients of =Theta0/(2^20 * 3^5 * 5 * 7)= are given as in [[file:theta0.csv][Theta0]].
# (org-table-export "./theta0.csv" "orgtbl-to-csv")
#+BEGIN_SRC sage :results table :exports none
  ts18_17_5 = sort_ts(S18_17_5.basis[0].keys())
  [(half_int_mat_to_list(t), S18_17_5.basis[0][t].vector/(2^20 * 3^5 * 5 * 7)) for t in ts18_17_5]
#+END_SRC

#+RESULTS:
| [1, 1, 1, 1, 1, 1] | (0, 0, 0, 0, -388869978684360, -486087473355450, 0, 486087473355450, 388869978684360, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -194434989342180, -194434989342180, -243043736677725, -243043736677725, 0, 0, 243043736677725, 243043736677725, 194434989342180, 194434989342180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -92698348581855, -94506007017549, -189012014035098, -21899884672449, -71207795453696, 121010203908500, 108506895311275, 108506895311275, 121010203908500, -71207795453696, -21899884672449, -189012014035098, -94506007017549, -92698348581855, 0, 0, 0, 0, 0, 0, 0, 0, -92698348581855, 1807658435694, 0, 83249066023107, 128447162259409, 93192846255412, 129997448439434, -12503308597225, 12503308597225, -129997448439434, -93192846255412, -128447162259409, -83249066023107, 0, -1807658435694, 92698348581855, 0, 0, 0, 0, 0, 194434989342180, 189012014035098, 167112129362649, 128447162259409, 35254316003997, 0, -74486626586159, -80385619080945, -80385619080945, -74486626586159, 0, 35254316003997, 128447162259409, 167112129362649, 189012014035098, 194434989342180, 0, 0, 388869978684360, 194434989342180, -48608747335545, -71207795453696, -192217999362196, -129997448439434, -142500757036659, -80385619080945, 0, 0, 80385619080945, 142500757036659, 129997448439434, 192217999362196, 71207795453696, 48608747335545, -194434989342180, -388869978684360, -486087473355450, -243043736677725, -243043736677725, -108506895311275, 0, 12503308597225, 142500757036659, 74486626586159, 74486626586159, 142500757036659, 12503308597225, 0, -108506895311275, -243043736677725, -243043736677725, -486087473355450, 0, 0, 243043736677725, 121010203908500, 192217999362196, 93192846255412, -35254316003997, 35254316003997, -93192846255412, -192217999362196, -121010203908500, -243043736677725, 0, 0, 486087473355450, 243043736677725, 48608747335545, 21899884672449, -167112129362649, -83249066023107, -83249066023107, -167112129362649, 21899884672449, 48608747335545, 243043736677725, 486087473355450, -388869978684360, -194434989342180, -194434989342180, -94506007017549, -1807658435694, 1807658435694, 94506007017549, 194434989342180, 194434989342180, 388869978684360, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |
| [1, 1, 1, 0, 0, 0] | (0, 0, 0, -6999659616318480, 0, 7777399573687200, 0, -7777399573687200, 0, 6999659616318480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11867944165368, 0, 0, -997065858095096, -1207736775154432, 0, 0, 1393676175149260, 1393676175149260, 0, 0, -1207736775154432, -997065858095096, 0, 0, 11867944165368, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -6999659616318480, 0, 0, 997065858095096, -210670917059336, 0, 0, 0, -358918384754340, 0, 0, -358918384754340, 0, 0, 0, -210670917059336, 997065858095096, 0, 0, -6999659616318480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7777399573687200, 0, 0, -1393676175149260, 0, 0, 0, 358918384754340, 358918384754340, 0, 0, 0, -1393676175149260, 0, 0, 7777399573687200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -7777399573687200, 0, 0, 1207736775154432, 210670917059336, 0, 0, 210670917059336, 1207736775154432, 0, 0, -7777399573687200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6999659616318480, 0, 0, -11867944165368, -11867944165368, 0, 0, 6999659616318480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| [1, 1, 2, 0, 0, 0] | (0, 0, 0, 83995915395821760, 0, -139993192326369600, 0, 163325391047431200, 0, -251987746187465280, 0, 1539925115590065600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -142415329984416, 0, 0, 15621190316862192, 8781153979102560, 0, 0, -39140995427273040, -4842574167845280, 0, 0, 50105634051842880, 36460674076972800, 0, 0, -209400996627548352, -124246831948789680, 0, 0, 977545529536799520, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 83995915395821760, 0, 0, -15621190316862192, -6840036337759632, 0, 0, 0, -18235332766047696, 0, 0, 51490671414750528, 34968540891135168, 0, 0, 75773620800276144, 399782661951279744, 0, 0, 644309853627688992, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -139993192326369600, 0, 0, 39140995427273040, 34298421259427760, 0, 0, -51490671414750528, -16522130523615360, 0, 0, 0, -390851202107001600, 0, 0, -568111000712872800, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 163325391047431200, 0, 0, -50105634051842880, -13644959974870080, 0, 0, -75773620800276144, 324009041151003600, 0, 0, 568111000712872800, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -251987746187465280, 0, 0, 209400996627548352, 85154164678758672, 0, 0, -644309853627688992, 0, 0, 0, 0, 0, 0, 1539925115590065600, 0, 0, -977545529536799520, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| [1, 1, 3, 1, 1, 1] | (0, 0, 0, 0, -40442477783173440, -66107896376341200, 69996596163184800, 291652484013270000, 102661674372671040, -755963238562395840, -1166609936053080000, 8212933949813683200, 92395506935403936000, 0, 0, 0, 0, 0, 0, 0, 0, -20221238891586720, -20221238891586720, -33053948188170600, -33053948188170600, 34998298081592400, 34998298081592400, 145826242006635000, 145826242006635000, 51330837186335520, 51330837186335520, -377981619281197920, -377981619281197920, -583304968026540000, -583304968026540000, 4106466974906841600, 4106466974906841600, 46197753467701968000, 46197753467701968000, 0, 0, 0, 0, 0, -9640628252512920, -9828624729825096, -19657249459650192, -6050048316676104, -6858241969689856, 33696651301013680, 29294447636497480, 39920739697916120, 37469663007332640, -48739344701063984, -8209918370140824, -102179808232230928, -79737110964056928, -40540629037742976, -250669328327766864, 1352445205845241200, 1563238687086280200, 11425549075362432120, 21564214230318635040, 0, 0, 0, -9640628252512920, 187996477312176, 0, 6887912187134616, 15908343263945960, 19581668469868112, 15987658458365664, -9850614400028040, -7899487426095320, -29102913880507376, 13877589140999264, 66983117361404984, 48896388298655824, -30757133703450752, -263328530261648640, -253004543869873632, 167917636661189256, -3696498211275605520, 6231373462439558400, 0, 0, 20221238891586720, 19657249459650192, 13607201142974088, 15908343263945960, -3673325205922152, 0, -30553765527470536, -9763029710954104, -7852541870773880, 31635557396902040, 64476394466782704, -407613675674482656, -420960600286169808, -1418599488168656040, -1103063990116409232, 1321495711701963840, -4830933819299647392, 34368387077573280, 40442477783173440, 20221238891586720, -12832709296583880, -6858241969689856, -40554893270703536, -15987658458365664, -25838272858393704, -9763029710954104, -1910487840180224, 0, 15968214620904920, -905091516065147920, -580498492311419440, -1478178692382668256, -456533539697524856, 5519885395119484248, -88329431371178272, -4060300338348323328, -66107896376341200, -33053948188170600, -68052246269763000, -29294447636497480, 10626292061418640, -7899487426095320, 21203426454412056, -31635557396902040, 32840837069880664, -905091516065147920, -324593023753728480, 0, 727410492195749800, 9362403076104646680, 3992090635622409720, -4342442073117153840, -69996596163184800, -34998298081592400, 110827943925042600, 37469663007332640, 86209007708396624, -13877589140999264, 53105528220405720, -407613675674482656, 13346924611687152, 1478178692382668256, 1021645152685143400, 9362403076104646680, 5370312440482236960, 0, 291652484013270000, 145826242006635000, 94495404820299480, 8209918370140824, -93969889862090104, 48896388298655824, 79653522002106576, 1418599488168656040, 315535498052246808, 5519885395119484248, 5608214826490662520, 4342442073117153840, -102661674372671040, -51330837186335520, -429312456467533440, -79737110964056928, -39196481926313952, 263328530261648640, 10323986391775008, 1321495711701963840, 6152429531001611232, 4060300338348323328, -755963238562395840, -377981619281197920, 205323348745342080, 250669328327766864, 1603114534173008064, 167917636661189256, 3864415847936794776, -34368387077573280, 1166609936053080000, 583304968026540000, 4689771942933381600, 1563238687086280200, -9862310388276151920, -6231373462439558400, 8212933949813683200, 4106466974906841600, -42091286492795126400, -21564214230318635040, -92395506935403936000, -46197753467701968000)                                                                                                                                                                                                                                                                                                            |
| [2, 2, 2, 2, 2, 2] | (0, -33557360856617326080, -13030278097475297280, 43259137106314752, -19135960866507124224, -25757202089228105600, 0, 25757202089228105600, 19135960866507124224, -43259137106314752, 13030278097475297280, 33557360856617326080, 0, 0, 0, -16778680428308663040, -16778680428308663040, -6515139048737648640, -6515139048737648640, 21629568553157376, 21629568553157376, -9567980433253562112, -9567980433253562112, -12878601044614052800, -12878601044614052800, 0, 0, 12878601044614052800, 12878601044614052800, 9567980433253562112, 9567980433253562112, -21629568553157376, -21629568553157376, 6515139048737648640, 6515139048737648640, 16778680428308663040, 16778680428308663040, 0, 0, -33557360856617326080, -16778680428308663040, -10263541379571014400, 0, -3726772762280208384, -10789889138361627456, -11189918311748564928, -18653063861216921472, -8427933072602631104, -8509604368957593856, 2170889311487500800, 3729062065672978240, 3729062065672978240, 2170889311487500800, -8509604368957593856, -8427933072602631104, -18653063861216921472, -11189918311748564928, -10789889138361627456, -3726772762280208384, 0, -10263541379571014400, -16778680428308663040, -33557360856617326080, 13030278097475297280, 6515139048737648640, 6536768617290806016, -10789889138361627456, 400029173386937472, 0, 4735055938229964608, 12116530191343358400, 7844458396325407488, 9484302446865847680, 1558172754185477440, -1558172754185477440, -9484302446865847680, -7844458396325407488, -12116530191343358400, -4735055938229964608, 0, -400029173386937472, 10789889138361627456, -6536768617290806016, -6515139048737648640, -13030278097475297280, 43259137106314752, 21629568553157376, 9589610001806719488, 18653063861216921472, 10225130788614290368, 12116530191343358400, 4272071795017950912, 0, -2745521525761724480, -5123616305217422016, -5123616305217422016, -2745521525761724480, 0, 4272071795017950912, 12116530191343358400, 10225130788614290368, 18653063861216921472, 9589610001806719488, 21629568553157376, 43259137106314752, 19135960866507124224, 9567980433253562112, -3310620611360490688, -8509604368957593856, -10680493680445094656, -9484302446865847680, -7926129692680370240, -5123616305217422016, 0, 0, 5123616305217422016, 7926129692680370240, 9484302446865847680, 10680493680445094656, 8509604368957593856, 3310620611360490688, -9567980433253562112, -19135960866507124224, -25757202089228105600, -12878601044614052800, -12878601044614052800, -3729062065672978240, 0, -1558172754185477440, 7926129692680370240, 2745521525761724480, 2745521525761724480, 7926129692680370240, -1558172754185477440, 0, -3729062065672978240, -12878601044614052800, -12878601044614052800, -25757202089228105600, 0, 0, 12878601044614052800, 2170889311487500800, 10680493680445094656, 7844458396325407488, -4272071795017950912, 4272071795017950912, -7844458396325407488, -10680493680445094656, -2170889311487500800, -12878601044614052800, 0, 0, 25757202089228105600, 12878601044614052800, 3310620611360490688, 8427933072602631104, -10225130788614290368, -4735055938229964608, -4735055938229964608, -10225130788614290368, 8427933072602631104, 3310620611360490688, 12878601044614052800, 25757202089228105600, -19135960866507124224, -9567980433253562112, -9589610001806719488, -11189918311748564928, -400029173386937472, 400029173386937472, 11189918311748564928, 9589610001806719488, 9567980433253562112, 19135960866507124224, -43259137106314752, -21629568553157376, -6536768617290806016, 3726772762280208384, 3726772762280208384, -6536768617290806016, -21629568553157376, -43259137106314752, -13030278097475297280, -6515139048737648640, 10263541379571014400, -10263541379571014400, 6515139048737648640, 13030278097475297280, 33557360856617326080, 16778680428308663040, 16778680428308663040, 33557360856617326080, 0, 0) |
| [1, 3, 3, 2, 0, 0] | (0, -73916405548323148800, -17919128617775308800, 9407542524332037120, -65653696241237867520, -90280054251361017600, 0, 90280054251361017600, 65653696241237867520, -9407542524332037120, 17919128617775308800, 73916405548323148800, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33666550058512673280, 118498146469296802560, 5936224975729240320, 15978171081562444800, 10286390193744153600, 27963118134117397440, 41204088585406320192, 50720312522761187712, 39531988871742808320, 18244164623012920768, 1791779050070146880, -14763564512218313600, -14763564512218313600, 1791779050070146880, 18244164623012920768, 39531988871742808320, 50720312522761187712, 41204088585406320192, 27963118134117397440, 10286390193744153600, 15978171081562444800, 5936224975729240320, 118498146469296802560, 33666550058512673280, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -441436741087224771072, -1230608310942302342208, -838513438048803228480, -782651996197658229120, -580583825436940689792, -278623335336176615552, -232681506993864117888, 109591823307780286848, 74018720394632788864, 214666470227466351744, 214666470227466351744, 74018720394632788864, 109591823307780286848, -232681506993864117888, -278623335336176615552, -580583825436940689792, -782651996197658229120, -838513438048803228480, -1230608310942302342208, -441436741087224771072, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1600511461848907514880, 2360725788879932623680, 1694690738950582683840, 1320308208082197138560, 916778829905327748480, 256648966013939400960, 22098699282197750528, -338544960761176853888, -338544960761176853888, 22098699282197750528, 256648966013939400960, 916778829905327748480, 1320308208082197138560, 1694690738950582683840, 2360725788879932623680, 1600511461848907514880, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -4004401103078201781120, -1895487621634503974720, -1951966304988219686208, -670153197262301616128, -714718001424515815680, -502352458200909568256, -502352458200909568256, -714718001424515815680, -670153197262301616128, -1951966304988219686208, -1895487621634503974720, -4004401103078201781120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8920801914402953890944, 12286417479534138649536, -1671343809606839753664, -2075584238458925552640, -2075584238458925552640, -1671343809606839753664, 12286417479534138649536, 8920801914402953890944, 0, 0, 0, 0, 0, 0, -17240552882269389932160, -72217703004858666076800, -72217703004858666076800, -17240552882269389932160, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| [2, 2, 2, 0, 0, 0] | (0, 0, 0, -116654350821068630016, 0, 167650545018621322240, 0, -167650545018621322240, 0, 116654350821068630016, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 398477724190089911808, 0, 0, -95761932762204749312, -216689877359597382656, 0, 0, 216902479448914919680, 216902479448914919680, 0, 0, -216689877359597382656, -95761932762204749312, 0, 0, 398477724190089911808, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -116654350821068630016, 0, 0, 95761932762204749312, -120927944597392633344, 0, 0, 0, -87237741848948088576, 0, 0, -87237741848948088576, 0, 0, 0, -120927944597392633344, 95761932762204749312, 0, 0, -116654350821068630016, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 167650545018621322240, 0, 0, -216902479448914919680, 0, 0, 0, 87237741848948088576, 87237741848948088576, 0, 0, 0, -216902479448914919680, 0, 0, 167650545018621322240, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -167650545018621322240, 0, 0, 216689877359597382656, 120927944597392633344, 0, 0, 120927944597392633344, 216689877359597382656, 0, 0, -167650545018621322240, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 116654350821068630016, 0, 0, -398477724190089911808, -398477724190089911808, 0, 0, 116654350821068630016, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |

#+BEGIN_SRC sage :exports none
  gcd_of_dict_vals(S18_17_5.basis[1]).factor()
#+END_SRC

#+RESULTS:
: 2^5 * 3^4 * 5 * 7^2

Fourier coefficients of =Theta1/(2^5 * 3^4 * 5 * 7^2)= are given as in [[file:theta1.csv][Theta1]].
# (org-table-export "./theta1.csv" "orgtbl-to-csv")
#+BEGIN_SRC sage :results table :exports none
  [(half_int_mat_to_list(t), S18_17_5.basis[1][t].vector/(2^5 * 3^4 * 5 * 7^2)) for t in ts18_17_5]
#+END_SRC

#+RESULTS:
| [1, 1, 1, 1, 1, 1] | (0, 0, 0, 0, 438300550283902927246120, 547875687854878659057650, 0, -547875687854878659057650, -438300550283902927246120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 219150275141951463623060, 219150275141951463623060, 273937843927439329528825, 273937843927439329528825, 0, 0, -273937843927439329528825, -273937843927439329528825, -219150275141951463623060, -219150275141951463623060, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 129478221064819164882075, 121516987667281791653857, 243033975334563583307714, -70337912151559688978003, 53584737695565944829128, -319758166364735801053100, -259226838133101563819375, -259226838133101563819375, -319758166364735801053100, 53584737695565944829128, -70337912151559688978003, 243033975334563583307714, 121516987667281791653857, 129478221064819164882075, 0, 0, 0, 0, 0, 0, 0, 0, 129478221064819164882075, 7961233397537373228218, 0, -266359490383671317916071, -263953828203827475762797, -271728999886863387298916, -335120321502354783872322, 60531328231634237233725, -60531328231634237233725, 335120321502354783872322, 271728999886863387298916, 263953828203827475762797, 266359490383671317916071, 0, -7961233397537373228218, -129478221064819164882075, 0, 0, 0, 0, 0, -219150275141951463623060, -243033975334563583307714, -313371887486123272285717, -263953828203827475762797, 7775171683035911536119, 0, 374240676728614144398627, 345405009304725605451605, 345405009304725605451605, 374240676728614144398627, 0, 7775171683035911536119, -263953828203827475762797, -313371887486123272285717, -243033975334563583307714, -219150275141951463623060, 0, 0, -438300550283902927246120, -219150275141951463623060, 54787568785487865905765, 53584737695565944829128, 373342904060301745882228, 335120321502354783872322, 395651649733989021106047, 345405009304725605451605, 0, 0, -345405009304725605451605, -395651649733989021106047, -335120321502354783872322, -373342904060301745882228, -53584737695565944829128, -54787568785487865905765, 219150275141951463623060, 438300550283902927246120, 547875687854878659057650, 273937843927439329528825, 273937843927439329528825, 259226838133101563819375, 0, -60531328231634237233725, -395651649733989021106047, -374240676728614144398627, -374240676728614144398627, -395651649733989021106047, -60531328231634237233725, 0, 259226838133101563819375, 273937843927439329528825, 273937843927439329528825, 547875687854878659057650, 0, 0, -273937843927439329528825, -319758166364735801053100, -373342904060301745882228, -271728999886863387298916, -7775171683035911536119, 7775171683035911536119, 271728999886863387298916, 373342904060301745882228, 319758166364735801053100, 273937843927439329528825, 0, 0, -547875687854878659057650, -273937843927439329528825, -54787568785487865905765, 70337912151559688978003, 313371887486123272285717, 266359490383671317916071, 266359490383671317916071, 313371887486123272285717, 70337912151559688978003, -54787568785487865905765, -273937843927439329528825, -547875687854878659057650, 438300550283902927246120, 219150275141951463623060, 219150275141951463623060, 121516987667281791653857, -7961233397537373228218, 7961233397537373228218, -121516987667281791653857, -219150275141951463623060, -219150275141951463623060, -438300550283902927246120, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
| [1, 1, 1, 0, 0, 0] | (0, 0, 0, 7889409905110252690430160, 0, -8766011005678058544922400, 0, 8766011005678058544922400, 0, -7889409905110252690430160, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -3414018691729061338004184, 0, 0, 7191398769873792582965528, 4161613409967710554994816, 0, 0, -4556897313155608955265180, -4556897313155608955265180, 0, 0, 4161613409967710554994816, 7191398769873792582965528, 0, 0, -3414018691729061338004184, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7889409905110252690430160, 0, 0, -7191398769873792582965528, -3029785359906082027970712, 0, 0, 0, -1105269894399807771389740, 0, 0, -1105269894399807771389740, 0, 0, 0, -3029785359906082027970712, -7191398769873792582965528, 0, 0, 7889409905110252690430160, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -8766011005678058544922400, 0, 0, 4556897313155608955265180, 0, 0, 0, 1105269894399807771389740, 1105269894399807771389740, 0, 0, 0, 4556897313155608955265180, 0, 0, -8766011005678058544922400, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8766011005678058544922400, 0, 0, -4161613409967710554994816, 3029785359906082027970712, 0, 0, 3029785359906082027970712, -4161613409967710554994816, 0, 0, 8766011005678058544922400, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -7889409905110252690430160, 0, 0, 3414018691729061338004184, 3414018691729061338004184, 0, 0, -7889409905110252690430160, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| [1, 1, 2, 0, 0, 0] | (0, 0, 0, -94672918861323032285161920, 0, 157788198102205053808603200, 0, -184086231119239229443370400, 0, 284018756583969096855485760, 0, -1735670179124255591894635200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40968224300748736056050208, 0, 0, -73535830319448230642683056, -54544551132216757629592800, 0, 0, 114126179952482622665544720, 54265318941320355767521440, 0, 0, 4820649707958748433110080, 259121070451066304558649600, 0, 0, 360811907095595111509093056, -617305261995271683941711760, 0, 0, 3202267627146366580978297440, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -94672918861323032285161920, 0, 0, 73535830319448230642683056, 18991279187231473013090256, 0, 0, 0, 53575809880626914743379088, 0, 0, -328220679295961588128976064, -257543001053225814043439424, 0, 0, 298268826559316732084924688, 780189928037123165892236928, 0, 0, -1717600163981149052254148256, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 157788198102205053808603200, 0, 0, -114126179952482622665544720, -59860861011162266898023280, 0, 0, 328220679295961588128976064, 70677678242735774085536640, 0, 0, 0, -595721081163349427531433600, 0, 0, 1942984562544958679167039200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -184086231119239229443370400, 0, 0, -4820649707958748433110080, 254300420743107556125539520, 0, 0, -298268826559316732084924688, 481921101477806433807312240, 0, 0, -1942984562544958679167039200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 284018756583969096855485760, 0, 0, -360811907095595111509093056, -978117169090866795450804816, 0, 0, 1717600163981149052254148256, 0, 0, 0, 0, 0, 0, -1735670179124255591894635200, 0, 0, -3202267627146366580978297440, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| [1, 1, 3, 1, 1, 1] | (0, 0, 0, 0, 45583257229525904433596480, 74511093548263497631840400, -78894099051102526904301600, -328725412712927195434590000, -115711345274950372792975680, 852056269751907290566457280, 1314901650851708781738360000, -9256907621996029823438054400, -104140210747455335513678112000, 0, 0, 0, 0, 0, 0, 0, 0, 22791628614762952216798240, 22791628614762952216798240, 37255546774131748815920200, 37255546774131748815920200, -39447049525551263452150800, -39447049525551263452150800, -164362706356463597717295000, -164362706356463597717295000, -57855672637475186396487840, -57855672637475186396487840, 426028134875953645283228640, 426028134875953645283228640, 657450825425854390869180000, 657450825425854390869180000, -4628453810998014911719027200, -4628453810998014911719027200, -52070105373727667756839056000, -52070105373727667756839056000, 0, 0, 0, 0, 0, 13465734990741193147735800, 12637766717397306332001128, 25275533434794612664002256, 7978662319657144983931752, 4996955339643653413813888, -41246634116606362405424240, -165183376692880057340963240, -82611381203960172560768760, -305414340282591970820863520, -1916186647697506058575888, 164069109093034735203195832, 217087042874573589605534544, 1369308641236446672049496544, 290545594214011063699486848, -276386636136418190690502768, -2240115602314662019232247600, -4438365349644453991724169000, -12761424986382783545828483160, -28943621426489258011733596320, 0, 0, 0, 13465734990741193147735800, 827968273343886815734672, 0, -9143684727611817379266488, -24763158425022615281385480, -26763833934862610865378576, -147718869531122814230799712, 24027780922720793233289320, -74838435579637310091266440, 116732926098759526090361008, 505521180918123565612227488, 56823809515820312685825128, 1043060112136961153868015408, -339692413690016287034169984, -2058846242402318623868121600, -753862016130909973115527584, -2385179533110272691217459368, 6395034260715605467617518160, -7588912432061077025795673600, 0, 0, -22791628614762952216798240, -25275533434794612664002256, -17296871115137467680070504, -24763158425022615281385480, 2000675509839995583993096, 0, 135610375943560069958254888, 222897131406348046788602072, 177499829696928122252578520, 474870760418916158217692360, -190274371829801711593920432, 392432761396453119116478048, -520123238210900016471860336, -1934469607643953296883482360, -849860622641729489015561264, -4178412577232622824366180160, 2445576360208834935806650656, 1860214845954043305720315360, -45583257229525904433596480, -22791628614762952216798240, 14463918159368796599121960, 4996955339643653413813888, 46243589456250015819238128, 147718869531122814230799712, 171746650453843607464089032, 222897131406348046788602072, 45397301709419924536023552, 0, -510941163337805662400187960, -50062334809326731723520240, -285963851993611029455006480, -977232678177007272022581792, -2663846118399792925166551592, -9285483731781855831792707064, -7872609388122159657851364704, 10054236980080303146720482304, 74511093548263497631840400, 37255546774131748815920200, 76702596299683012268071000, 165183376692880057340963240, 82571995488919884780194480, -74838435579637310091266440, -191571361678396836181627448, -474870760418916158217692360, -665145132248717869811612792, -50062334809326731723520240, 235901517184284297731486240, 0, -3524233219229215087715547400, -13146845894571564968845235640, -9442647714728649665913879960, 11123475735995673361183380720, 78894099051102526904301600, 39447049525551263452150800, -124915656830912334265144200, -305414340282591970820863520, -303498153634894464762287632, -505521180918123565612227488, -448697371402303252926402360, 392432761396453119116478048, 912555999607353135588338384, 977232678177007272022581792, -1686613440222785653143969800, -13146845894571564968845235640, -3704198179842915302931355680, 0, -328725412712927195434590000, -164362706356463597717295000, -106507033718988411320807160, -164069109093034735203195832, 53017933781538854402338712, 1043060112136961153868015408, 1382752525826977440902185392, 1934469607643953296883482360, 1084608985002223807867921096, -9285483731781855831792707064, -1412874343659696173941342360, -11123475735995673361183380720, 115711345274950372792975680, 57855672637475186396487840, 483883807513428831679716480, 1369308641236446672049496544, 1078763047022435608350009696, 2058846242402318623868121600, 1304984226271408650752594016, -4178412577232622824366180160, -6623988937441457760172830816, -10054236980080303146720482304, 852056269751907290566457280, 426028134875953645283228640, -231422690549900745585951360, 276386636136418190690502768, -1963728966178243828541744832, -2385179533110272691217459368, -8780213793825878158834977528, -1860214845954043305720315360, -1314901650851708781738360000, -657450825425854390869180000, -5285904636423869302588207200, -4438365349644453991724169000, 8323059636738329554104314160, 7588912432061077025795673600, -9256907621996029823438054400, -4628453810998014911719027200, 47441651562729652845120028800, 28943621426489258011733596320, 104140210747455335513678112000, 52070105373727667756839056000)                                                                                                                                                                                                                                                                                                                                                            |
| [2, 2, 2, 2, 2, 2] | (0, -203270671019911652422868021760, -110570464716778027001611100160, -4656827822356937607581892096, -12716772733767891591941585408, -33472804378420876058170921600, 0, 33472804378420876058170921600, 12716772733767891591941585408, 4656827822356937607581892096, 110570464716778027001611100160, 203270671019911652422868021760, 0, 0, 0, -101635335509955826211434010880, -101635335509955826211434010880, -55285232358389013500805550080, -55285232358389013500805550080, -2328413911178468803790946048, -2328413911178468803790946048, -6358386366883945795970792704, -6358386366883945795970792704, -16736402189210438029085460800, -16736402189210438029085460800, 0, 0, 16736402189210438029085460800, 16736402189210438029085460800, 6358386366883945795970792704, 6358386366883945795970792704, 2328413911178468803790946048, 2328413911178468803790946048, 55285232358389013500805550080, 55285232358389013500805550080, 101635335509955826211434010880, 101635335509955826211434010880, 0, 0, -203270671019911652422868021760, -101635335509955826211434010880, -46350103151566812710628460800, 0, 6606715295643731986386143232, 68266647660479294116381328448, 32205316533961864926544364224, 57803917772279997866702585216, 12649243243211388622393730752, 10067761212889158260758531328, -21227561925763968610656012800, -25756951089011049023905939520, -25756951089011049023905939520, -21227561925763968610656012800, 10067761212889158260758531328, 12649243243211388622393730752, 57803917772279997866702585216, 32205316533961864926544364224, 68266647660479294116381328448, 6606715295643731986386143232, 0, -46350103151566812710628460800, -101635335509955826211434010880, -203270671019911652422868021760, 110570464716778027001611100160, 55285232358389013500805550080, 52956818447210544697014604032, 68266647660479294116381328448, 36061331126517429189836964224, 0, -38959388871974273305837649984, -67139472140614636607631070400, -63081675744070385799857080064, -65029582876995235851471807360, -4529389163247080413249926720, 4529389163247080413249926720, 65029582876995235851471807360, 63081675744070385799857080064, 67139472140614636607631070400, 38959388871974273305837649984, 0, -36061331126517429189836964224, -68266647660479294116381328448, -52956818447210544697014604032, -55285232358389013500805550080, -110570464716778027001611100160, -4656827822356937607581892096, -2328413911178468803790946048, 4029972455705476992179846656, -57803917772279997866702585216, -45154674529068609244308854464, -67139472140614636607631070400, -4057796396544250807773990336, 0, 73113434326665661633795302720, 78616777056375167072852593088, 78616777056375167072852593088, 73113434326665661633795302720, 0, -4057796396544250807773990336, -67139472140614636607631070400, -45154674529068609244308854464, -57803917772279997866702585216, 4029972455705476992179846656, -2328413911178468803790946048, -4656827822356937607581892096, 12716772733767891591941585408, 6358386366883945795970792704, -10378015822326492233114668096, 10067761212889158260758531328, 31295323138653126871414544128, 65029582876995235851471807360, 60500193713748155438221880640, 78616777056375167072852593088, 0, 0, -78616777056375167072852593088, -60500193713748155438221880640, -65029582876995235851471807360, -31295323138653126871414544128, -10067761212889158260758531328, 10378015822326492233114668096, -6358386366883945795970792704, -12716772733767891591941585408, -33472804378420876058170921600, -16736402189210438029085460800, -16736402189210438029085460800, 25756951089011049023905939520, 0, 4529389163247080413249926720, -60500193713748155438221880640, -73113434326665661633795302720, -73113434326665661633795302720, -60500193713748155438221880640, 4529389163247080413249926720, 0, 25756951089011049023905939520, -16736402189210438029085460800, -16736402189210438029085460800, -33472804378420876058170921600, 0, 0, 16736402189210438029085460800, -21227561925763968610656012800, -31295323138653126871414544128, -63081675744070385799857080064, 4057796396544250807773990336, -4057796396544250807773990336, 63081675744070385799857080064, 31295323138653126871414544128, 21227561925763968610656012800, -16736402189210438029085460800, 0, 0, 33472804378420876058170921600, 16736402189210438029085460800, 10378015822326492233114668096, -12649243243211388622393730752, 45154674529068609244308854464, 38959388871974273305837649984, 38959388871974273305837649984, 45154674529068609244308854464, -12649243243211388622393730752, 10378015822326492233114668096, 16736402189210438029085460800, 33472804378420876058170921600, -12716772733767891591941585408, -6358386366883945795970792704, -4029972455705476992179846656, 32205316533961864926544364224, -36061331126517429189836964224, 36061331126517429189836964224, -32205316533961864926544364224, 4029972455705476992179846656, 6358386366883945795970792704, 12716772733767891591941585408, 4656827822356937607581892096, 2328413911178468803790946048, -52956818447210544697014604032, -6606715295643731986386143232, -6606715295643731986386143232, -52956818447210544697014604032, 2328413911178468803790946048, 4656827822356937607581892096, -110570464716778027001611100160, -55285232358389013500805550080, 46350103151566812710628460800, -46350103151566812710628460800, 55285232358389013500805550080, 110570464716778027001611100160, 203270671019911652422868021760, 101635335509955826211434010880, 101635335509955826211434010880, 203270671019911652422868021760, 0, 0) |
| [1, 3, 3, 2, 0, 0] | (0, 83312168597964268410942489600, 20196889357082246887501209600, -10603366912468179615938135040, 73999158505531899012816931840, 101755855753910903589459219200, 0, -101755855753910903589459219200, -73999158505531899012816931840, 10603366912468179615938135040, -20196889357082246887501209600, -83312168597964268410942489600, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -884154932901168838968592765440, -159534988000727134028906407680, -292952229103552920339084975360, 21169340060947640514687974400, -29105150299838403282795617280, 102048987669682666168895519040, 118493363191245191912990334144, 160080216780430333100905496704, 252731780185588470917355759360, 168501085254022553581448547136, 247051715329942455192343296960, 181737429838129237310386185600, 181737429838129237310386185600, 247051715329942455192343296960, 168501085254022553581448547136, 252731780185588470917355759360, 160080216780430333100905496704, 118493363191245191912990334144, 102048987669682666168895519040, -29105150299838403282795617280, 21169340060947640514687974400, -292952229103552920339084975360, -159534988000727134028906407680, -884154932901168838968592765440, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1246279778737943403469779933696, 2039915959712293556939703753024, 1347929944364279446628464034880, 761080842799318701488653395840, 798606662007708551032748601216, 139245604184757717924576189056, 250577742708287907729553862784, -259863795587812354419333834624, -194688152217650124754487759232, -338711629394269541491387825792, -338711629394269541491387825792, -194688152217650124754487759232, -259863795587812354419333834624, 250577742708287907729553862784, 139245604184757717924576189056, 798606662007708551032748601216, 761080842799318701488653395840, 1347929944364279446628464034880, 2039915959712293556939703753024, 1246279778737943403469779933696, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2605088601536240807002610442240, -4545044442232586836561431320640, -2325136425724683216066118902720, -1113050755370290205049624433280, -1151203220907413600734394451840, 268567394547443288211627185920, 101573577339140687821855984896, 897381889331060929982169905024, 897381889331060929982169905024, 101573577339140687821855984896, 268567394547443288211627185920, -1151203220907413600734394451840, -1113050755370290205049624433280, -2325136425724683216066118902720, -4545044442232586836561431320640, -2605088601536240807002610442240, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8050398880878598261589360050560, 8298513587302259025843985616960, 1583463639494894303420618892864, -371544609416435252097383684096, 66800398451772421849722604800, -445466820199244869616829887232, -445466820199244869616829887232, 66800398451772421849722604800, -371544609416435252097383684096, 1583463639494894303420618892864, 8298513587302259025843985616960, 8050398880878598261589360050560, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -15500547831013576081034552180352, -34058260503136254249222569903808, 7143522379159017539546506790592, 2099724642436338943317153807360, 2099724642436338943317153807360, 7143522379159017539546506790592, -34058260503136254249222569903808, -15500547831013576081034552180352, 0, 0, 0, 0, 0, 0, 82645862104449035637694885476480, 250978046378243437929009624681600, 250978046378243437929009624681600, 82645862104449035637694885476480, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| [2, 2, 2, 0, 0, 0] | (0, 0, 0, -1454195569101604559061893609472, 0, 1346647507663504195669149076480, 0, -1346647507663504195669149076480, 0, 1454195569101604559061893609472, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 299641691415397544981484734976, 0, 0, 874531772668044916331064137216, 419506794237545107634938108928, 0, 0, -993203864161492064693057475840, -993203864161492064693057475840, 0, 0, 419506794237545107634938108928, 874531772668044916331064137216, 0, 0, 299641691415397544981484734976, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1454195569101604559061893609472, 0, 0, -874531772668044916331064137216, -455024978430499808696126028288, 0, 0, 0, -6406063332286835361363342592, 0, 0, -6406063332286835361363342592, 0, 0, 0, -455024978430499808696126028288, -874531772668044916331064137216, 0, 0, -1454195569101604559061893609472, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1346647507663504195669149076480, 0, 0, 993203864161492064693057475840, 0, 0, 0, 6406063332286835361363342592, 6406063332286835361363342592, 0, 0, 0, 993203864161492064693057475840, 0, 0, 1346647507663504195669149076480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1346647507663504195669149076480, 0, 0, -419506794237545107634938108928, 455024978430499808696126028288, 0, 0, 455024978430499808696126028288, -419506794237545107634938108928, 0, 0, -1346647507663504195669149076480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1454195569101604559061893609472, 0, 0, -299641691415397544981484734976, -299641691415397544981484734976, 0, 0, 1454195569101604559061893609472, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |

#+BEGIN_SRC sage :exports none
  gcd_of_dict_vals(S18_17_5.basis[2]).factor()
#+END_SRC

#+RESULTS:
: 2^8 * 3^2 * 5^3

Fourier coefficients of =Theta2/(2^8 * 3^2 * 5^3)= are given as in [[file:theta2.csv][Theta2]].
# (org-table-export "./theta2.csv" "orgtbl-to-csv")
#+BEGIN_SRC sage :results table :exports none
  [(half_int_mat_to_list(t), S18_17_5.basis[2][t].vector/(2^8 * 3^2 * 5^3)) for t in ts18_17_5]
#+END_SRC

#+RESULTS:
| [1, 1, 1, 1, 1, 1] | (0, 0, 0, 0, -738097079296302085391592, -922621349120377606739490, 0, 922621349120377606739490, 738097079296302085391592, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -369048539648151042695796, -369048539648151042695796, -461310674560188803369745, -461310674560188803369745, 0, 0, 461310674560188803369745, 461310674560188803369745, 369048539648151042695796, 369048539648151042695796, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -104427322983251080870923, -136466101719580857061713, -272932203439161714123426, 61668882767047517905851, -86440496258869620167920, 330224974144380624945940, 260738629861045941835415, 260738629861045941835415, 330224974144380624945940, -86440496258869620167920, 61668882767047517905851, -272932203439161714123426, -136466101719580857061713, -104427322983251080870923, 0, 0, 0, 0, 0, 0, 0, 0, -104427322983251080870923, 32038778736329776190790, 0, 227042325221676349971279, 215399047915340068959221, 200102421842844947575172, 278725456585427402538418, -69486344283334683110525, 69486344283334683110525, -278725456585427402538418, -200102421842844947575172, -215399047915340068959221, -227042325221676349971279, 0, -32038778736329776190790, 104427322983251080870923, 0, 0, 0, 0, 0, 369048539648151042695796, 272932203439161714123426, 334601086206209232029277, 215399047915340068959221, 15296626072495121384049, 0, -257527063586896562534443, -227352236674853106905541, -227352236674853106905541, -257527063586896562534443, 0, 15296626072495121384049, 215399047915340068959221, 334601086206209232029277, 272932203439161714123426, 369048539648151042695796, 0, 0, 738097079296302085391592, 369048539648151042695796, -92262134912037760673949, -86440496258869620167920, -416665470403250245113860, -278725456585427402538418, -348211800868762085648943, -227352236674853106905541, 0, 0, 227352236674853106905541, 348211800868762085648943, 278725456585427402538418, 416665470403250245113860, 86440496258869620167920, 92262134912037760673949, -369048539648151042695796, -738097079296302085391592, -922621349120377606739490, -461310674560188803369745, -461310674560188803369745, -260738629861045941835415, 0, 69486344283334683110525, 348211800868762085648943, 257527063586896562534443, 257527063586896562534443, 348211800868762085648943, 69486344283334683110525, 0, -260738629861045941835415, -461310674560188803369745, -461310674560188803369745, -922621349120377606739490, 0, 0, 461310674560188803369745, 330224974144380624945940, 416665470403250245113860, 200102421842844947575172, -15296626072495121384049, 15296626072495121384049, -200102421842844947575172, -416665470403250245113860, -330224974144380624945940, -461310674560188803369745, 0, 0, 922621349120377606739490, 461310674560188803369745, 92262134912037760673949, -61668882767047517905851, -334601086206209232029277, -227042325221676349971279, -227042325221676349971279, -334601086206209232029277, -61668882767047517905851, 92262134912037760673949, 461310674560188803369745, 922621349120377606739490, -738097079296302085391592, -369048539648151042695796, -369048539648151042695796, -136466101719580857061713, -32038778736329776190790, 32038778736329776190790, 136466101719580857061713, 369048539648151042695796, 369048539648151042695796, 738097079296302085391592, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| [1, 1, 1, 0, 0, 0] | (0, 0, 0, -13285747427333437537048656, 0, 14761941585926041707831840, 0, -14761941585926041707831840, 0, 13285747427333437537048656, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2296202372630252800901976, 0, 0, -3537612267688221470333656, -2282390313470254088397824, 0, 0, 2318318342686119660345980, 2318318342686119660345980, 0, 0, -2282390313470254088397824, -3537612267688221470333656, 0, 0, 2296202372630252800901976, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -13285747427333437537048656, 0, 0, 3537612267688221470333656, 1255221954217967381935832, 0, 0, 0, 357626597866305947871948, 0, 0, 357626597866305947871948, 0, 0, 0, 1255221954217967381935832, 3537612267688221470333656, 0, 0, -13285747427333437537048656, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14761941585926041707831840, 0, 0, -2318318342686119660345980, 0, 0, 0, -357626597866305947871948, -357626597866305947871948, 0, 0, 0, -2318318342686119660345980, 0, 0, 14761941585926041707831840, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -14761941585926041707831840, 0, 0, 2282390313470254088397824, -1255221954217967381935832, 0, 0, -1255221954217967381935832, 2282390313470254088397824, 0, 0, -14761941585926041707831840, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13285747427333437537048656, 0, 0, -2296202372630252800901976, -2296202372630252800901976, 0, 0, 13285747427333437537048656, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |
| [1, 1, 2, 0, 0, 0] | (0, 0, 0, 159428969128001250444583872, 0, -265714948546668750740973120, 0, 310000773304446875864468640, 0, -478286907384003751333751616, 0, 2922864434013356258150704320, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -27554428471563033610823712, 0, 0, 49680033781624229714107824, 32965867339923649602958560, 0, 0, -84043017173994877981572240, -19589555243434932291950880, 0, 0, 12404918227108550850958656, -128132766420329587767465216, 0, 0, -148433025807893597188782528, 298063745088364417452535440, 0, 0, -1674487473577070455762604640, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 159428969128001250444583872, 0, 0, -49680033781624229714107824, -16714166441700580111149264, 0, 0, 0, -47302709120943707913615120, 0, 0, 242097265775180763946185024, 177909410674342057959794880, 0, 0, -132819762607315198968316560, -40946841144889714677863808, 0, 0, 1915427670054931963849221792, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -265714948546668750740973120, 0, 0, 84043017173994877981572240, 64453461930559945689621360, 0, 0, -242097265775180763946185024, -64187855100838705986390144, 0, 0, 0, -28545667661182814102684160, 0, 0, -2092556202252160729800864480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 310000773304446875864468640, 0, 0, -12404918227108550850958656, -140537684647438138618423872, 0, 0, 132819762607315198968316560, 91872921462425484290452752, 0, 0, 2092556202252160729800864480, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -478286907384003751333751616, 0, 0, 148433025807893597188782528, 446496770896258014641317968, 0, 0, -1915427670054931963849221792, 0, 0, 0, 0, 0, 0, 2922864434013356258150704320, 0, 0, 1674487473577070455762604640, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| [1, 1, 3, 1, 1, 1] | (0, 0, 0, 0, -76762096246815416880725568, -125476503480371354516570640, 132857474273334375370486560, 553572809472226564043694000, 194857628934223750543380288, -1434860722152011254001254848, -2214291237888906256174776000, 15588610314737900043470423040, 175371866040801375489042259200, 0, 0, 0, 0, 0, 0, 0, 0, -38381048123407708440362784, -38381048123407708440362784, -62738251740185677258285320, -62738251740185677258285320, 66428737136667187685243280, 66428737136667187685243280, 276786404736113282021847000, 276786404736113282021847000, 97428814467111875271690144, 97428814467111875271690144, -717430361076005627000627424, -717430361076005627000627424, -1107145618944453128087388000, -1107145618944453128087388000, 7794305157368950021735211520, 7794305157368950021735211520, 87685933020400687744521129600, 87685933020400687744521129600, 0, 0, 0, 0, 0, -10860441590258112410575992, -14192474578836409134418152, -28384949157672818268836304, -5164756689229136194386984, -19836752401070591842296320, 59613071360801362543510640, 115440036491734662984819560, 96039883934534967810804280, 233378008603010996164713120, -52111200673063355036070640, -115787149519024808926340856, -330460207331194229881403216, -943957664113009808764128480, -300654631998142481220604800, 49669525393250386167680112, 3279917989293467031861376560, 5992529956692030742054021800, 23339934607280872417184281560, 42183337849880552880637637280, 0, 0, 0, -10860441590258112410575992, 3332032988578296723842160, 0, 13625891870514244166035704, 13146370737509197652544520, 27740643684151059050075536, 98239604526925815139293792, -13868603066162857016251560, 67642556471379870896348360, -96038060311411747903886512, -297052133825849230148065568, -67934742927157537561783400, -617756250863011662554238448, 138885132553150411839781760, 1102706746726358858110791936, 550113836150792510474149536, 2912401646157963353278509864, -6761369600077341063593624400, 9369421675123775689667086080, 0, 0, 38381048123407708440362784, 28384949157672818268836304, 23220192468443682074449320, 13146370737509197652544520, -14594272946641861397531016, 0, -98473371513521479407384296, -115616272821682394643488984, -108252637641229419717864664, -268482437232537938481237512, 106565144696990728031306928, -776085520133537681330072928, -144189815677132189026558480, -423615674871187620493645896, -436280252795743988204848848, 4627620085049178172274855232, -6425982446135995731778654752, -3324099933861644353379078880, 76762096246815416880725568, 38381048123407708440362784, -24357203616777968817922536, -19836752401070591842296320, -79449823761871954385806960, -98239604526925815139293792, -112108207593088672155545352, -115616272821682394643488984, -7363635180452974925624320, 0, 282541177421608009274605240, -1096018351687395339329911760, -498222649902001299704741360, -1154223595159534557927897696, 1378796973604048775411471144, 12180626293957104134035169208, 5102790200664061158406462048, -11191282719837063919676794368, -125476503480371354516570640, -62738251740185677258285320, -129166988876852864943528600, -115440036491734662984819560, -19400152557199695174015280, 67642556471379870896348360, 163680616782791618800234872, 268482437232537938481237512, 375047581929528666512544440, -1096018351687395339329911760, -597795701785394039625170400, 0, 3302272663452849776061125960, 18979271925850845973777900920, 10614135912206443312026158040, -11035827531737779435034983920, -132857474273334375370486560, -66428737136667187685243280, 210357667599446094336603720, 233378008603010996164713120, 285489209276074351200783760, 297052133825849230148065568, 229117390898691692586282168, -776085520133537681330072928, -631895704456405492303514448, 1154223595159534557927897696, 2533020568763583333339368840, 18979271925850845973777900920, 8365136013644402661751742880, 0, 553572809472226564043694000, 276786404736113282021847000, 179357590269001406750156856, 115787149519024808926340856, -214673057812169420955062360, -617756250863011662554238448, -756641383416162074394020208, 423615674871187620493645896, -12664577924556367711202952, 12180626293957104134035169208, 7077836093293042975628707160, 11035827531737779435034983920, -194857628934223750543380288, -97428814467111875271690144, -814859175543117502272317568, -943957664113009808764128480, -643303032114867327543523680, -1102706746726358858110791936, -552592910575566347636642400, 4627620085049178172274855232, 11053602531185173904053509984, 11191282719837063919676794368, -1434860722152011254001254848, -717430361076005627000627424, 389715257868447501086760576, -49669525393250386167680112, 3230248463900216645693696448, 2912401646157963353278509864, 9673771246235304416872134264, 3324099933861644353379078880, 2214291237888906256174776000, 1107145618944453128087388000, 8901450776313403149822599520, 5992529956692030742054021800, -17347404650588841675130259760, -9369421675123775689667086080, 15588610314737900043470423040, 7794305157368950021735211520, -79891627863031737722785918080, -42183337849880552880637637280, -175371866040801375489042259200, -87685933020400687744521129600)                                                                                                                                                                                                                                                                                                   |
| [2, 2, 2, 2, 2, 2] | (0, 80979222173541934853054231040, 39409034615497314589710950400, -5612146509517972801746485760, -10156696904395978129181394432, -1017527059332552194743008640, 0, 1017527059332552194743008640, 10156696904395978129181394432, 5612146509517972801746485760, -39409034615497314589710950400, -80979222173541934853054231040, 0, 0, 0, 40489611086770967426527115520, 40489611086770967426527115520, 19704517307748657294855475200, 19704517307748657294855475200, -2806073254758986400873242880, -2806073254758986400873242880, -5078348452197989064590697216, -5078348452197989064590697216, -508763529666276097371504320, -508763529666276097371504320, 0, 0, 508763529666276097371504320, 508763529666276097371504320, 5078348452197989064590697216, 5078348452197989064590697216, 2806073254758986400873242880, 2806073254758986400873242880, -19704517307748657294855475200, -19704517307748657294855475200, -40489611086770967426527115520, -40489611086770967426527115520, 0, 0, 80979222173541934853054231040, 40489611086770967426527115520, 20785093779022310131671640320, 0, -1725496783485333564057077760, -42910530950866042664740650048, -22388854210900030818064968384, -43052211638314728072072859008, -13121791336915747384505437888, -11891615902983537600305376512, 10368817047748103467718822400, 14131547372418211084994984000, 14131547372418211084994984000, 10368817047748103467718822400, -11891615902983537600305376512, -13121791336915747384505437888, -43052211638314728072072859008, -22388854210900030818064968384, -42910530950866042664740650048, -1725496783485333564057077760, 0, 20785093779022310131671640320, 40489611086770967426527115520, 80979222173541934853054231040, -39409034615497314589710950400, -19704517307748657294855475200, -22510590562507643695728718080, -42910530950866042664740650048, -20521676739966011846675681664, 0, 20811342964698415961874917440, 42704875826045323000082869440, 36651235556462389821160204032, 39183790447200287654236304256, 3762730324670107617276161600, -3762730324670107617276161600, -39183790447200287654236304256, -36651235556462389821160204032, -42704875826045323000082869440, -20811342964698415961874917440, 0, 20521676739966011846675681664, 42910530950866042664740650048, 22510590562507643695728718080, 19704517307748657294855475200, 39409034615497314589710950400, -5612146509517972801746485760, -2806073254758986400873242880, 2272275197439002663717454336, 43052211638314728072072859008, 29930420301398980687567421120, 42704875826045323000082869440, 6053640269582933178922665408, 0, -37645749783934266350432451904, -42674757553973322884246663616, -42674757553973322884246663616, -37645749783934266350432451904, 0, 6053640269582933178922665408, 42704875826045323000082869440, 29930420301398980687567421120, 43052211638314728072072859008, 2272275197439002663717454336, -2806073254758986400873242880, -5612146509517972801746485760, 10156696904395978129181394432, 5078348452197989064590697216, 4569584922531712967219192896, -11891615902983537600305376512, -22260432950731641068024198912, -39183790447200287654236304256, -35421060122530180036960142656, -42674757553973322884246663616, 0, 0, 42674757553973322884246663616, 35421060122530180036960142656, 39183790447200287654236304256, 22260432950731641068024198912, 11891615902983537600305376512, -4569584922531712967219192896, -5078348452197989064590697216, -10156696904395978129181394432, -1017527059332552194743008640, -508763529666276097371504320, -508763529666276097371504320, -14131547372418211084994984000, 0, -3762730324670107617276161600, 35421060122530180036960142656, 37645749783934266350432451904, 37645749783934266350432451904, 35421060122530180036960142656, -3762730324670107617276161600, 0, -14131547372418211084994984000, -508763529666276097371504320, -508763529666276097371504320, -1017527059332552194743008640, 0, 0, 508763529666276097371504320, 10368817047748103467718822400, 22260432950731641068024198912, 36651235556462389821160204032, -6053640269582933178922665408, 6053640269582933178922665408, -36651235556462389821160204032, -22260432950731641068024198912, -10368817047748103467718822400, -508763529666276097371504320, 0, 0, 1017527059332552194743008640, 508763529666276097371504320, -4569584922531712967219192896, 13121791336915747384505437888, -29930420301398980687567421120, -20811342964698415961874917440, -20811342964698415961874917440, -29930420301398980687567421120, 13121791336915747384505437888, -4569584922531712967219192896, 508763529666276097371504320, 1017527059332552194743008640, -10156696904395978129181394432, -5078348452197989064590697216, -2272275197439002663717454336, -22388854210900030818064968384, 20521676739966011846675681664, -20521676739966011846675681664, 22388854210900030818064968384, 2272275197439002663717454336, 5078348452197989064590697216, 10156696904395978129181394432, 5612146509517972801746485760, 2806073254758986400873242880, 22510590562507643695728718080, 1725496783485333564057077760, 1725496783485333564057077760, 22510590562507643695728718080, 2806073254758986400873242880, 5612146509517972801746485760, 39409034615497314589710950400, 19704517307748657294855475200, -20785093779022310131671640320, 20785093779022310131671640320, -19704517307748657294855475200, -39409034615497314589710950400, -80979222173541934853054231040, -40489611086770967426527115520, -40489611086770967426527115520, -80979222173541934853054231040, 0, 0) |
| [1, 3, 3, 2, 0, 0] | (0, -140297492832641100391233807360, -34011513413973600094844559360, 17856044542336140049793393664, -124614406091753273680833260544, -171356617929429492144511998720, 0, 171356617929429492144511998720, 124614406091753273680833260544, -17856044542336140049793393664, 34011513413973600094844559360, 140297492832641100391233807360, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 431405490944748054665136222720, 150600096870980461254669715200, 125616517670157903230017731840, -30426172890516157084165463040, 3991735572409193673147300864, -77556692941026083936434075968, -51980188068466434355238329536, -80715385889167351035581685888, -124101585061947652428450067200, -87515274645136338750243020608, -136291954584540303310567501760, -106496953043808503380732973440, -106496953043808503380732973440, -136291954584540303310567501760, -87515274645136338750243020608, -124101585061947652428450067200, -80715385889167351035581685888, -51980188068466434355238329536, -77556692941026083936434075968, 3991735572409193673147300864, -30426172890516157084165463040, 125616517670157903230017731840, 150600096870980461254669715200, 431405490944748054665136222720, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1131663934533066931092219812352, -2570485079319233777595370043712, -1740831051764716803259304330304, -1233723966464196981443669854080, -1175139996997994154144705941376, -326819596616643159977440180864, -442392918759420776521151021184, 334573123438187749255811667840, 208234070109410792445880168832, 484271389452021896843718966912, 484271389452021896843718966912, 208234070109410792445880168832, 334573123438187749255811667840, -442392918759420776521151021184, -326819596616643159977440180864, -1175139996997994154144705941376, -1233723966464196981443669854080, -1740831051764716803259304330304, -2570485079319233777595370043712, -1131663934533066931092219812352, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3155272202021758359783497333760, 5352846140509008111316665752640, 3280912397111740734344991791040, 1804393300942836050501378227840, 1740505716084675584563751717760, -101991565496364482254857573120, -66009163680368551163032766720, -1029219629957925894921579451264, -1029219629957925894921579451264, -66009163680368551163032766720, -101991565496364482254857573120, 1740505716084675584563751717760, 1804393300942836050501378227840, 3280912397111740734344991791040, 5352846140509008111316665752640, 3155272202021758359783497333760, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -8633833447082480490479846302080, -7167821241967090021609810016320, -3359016801961938764350257638976, -133373490072201694257937782784, -1196708441554350197239432260864, -492290244922872399141083557120, -492290244922872399141083557120, -1196708441554350197239432260864, -133373490072201694257937782784, -3359016801961938764350257638976, -7167821241967090021609810016320, -8633833447082480490479846302080, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17200365579051053826587936188032, 37581760284994402420506920259264, -4171382345139755570630446063296, -3349171716172119787201473180672, -3349171716172119787201473180672, -4171382345139755570630446063296, 37581760284994402420506920259264, 17200365579051053826587936188032, 0, 0, 0, 0, 0, 0, -52060112863600636903620884887680, -267173511023289004766074392005760, -267173511023289004766074392005760, -52060112863600636903620884887680, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| [2, 2, 2, 0, 0, 0] | (0, 0, 0, 799401315177989486267818309632, 0, -629866558023937731048027704320, 0, 629866558023937731048027704320, 0, -799401315177989486267818309632, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 156329681969331837020250158592, 0, 0, -492869962562988286270232647168, -350253357632253352358312270848, 0, 0, 701677186206397282641309512960, 701677186206397282641309512960, 0, 0, -350253357632253352358312270848, -492869962562988286270232647168, 0, 0, 156329681969331837020250158592, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 799401315177989486267818309632, 0, 0, 492869962562988286270232647168, 142616604930734933911920376320, 0, 0, 0, -130665545459571536323813731072, 0, 0, -130665545459571536323813731072, 0, 0, 0, 142616604930734933911920376320, 492869962562988286270232647168, 0, 0, 799401315177989486267818309632, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -629866558023937731048027704320, 0, 0, -701677186206397282641309512960, 0, 0, 0, 130665545459571536323813731072, 130665545459571536323813731072, 0, 0, 0, -701677186206397282641309512960, 0, 0, -629866558023937731048027704320, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 629866558023937731048027704320, 0, 0, 350253357632253352358312270848, -142616604930734933911920376320, 0, 0, -142616604930734933911920376320, 350253357632253352358312270848, 0, 0, 629866558023937731048027704320, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -799401315177989486267818309632, 0, 0, -156329681969331837020250158592, -156329681969331837020250158592, 0, 0, -799401315177989486267818309632, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |


* Hecke eigenforms
The characteristic polynomial of =T(2)= is given as follows.
#+BEGIN_SRC sage :exports results
  S18_17_5.hecke_charpoly_tp(2).factor()
#+END_SRC

#+RESULTS:
: (x - 285120) * (x^2 - 122112*x - 6040977408)

Let =F0 = -27411940570812415758258813595452421519092205 * Theta0 + 426844081323506188348315458383164538880 * Theta1 + 1108258366195376623065993820933390921728 * Theta2= .
Then it is an eigenform whose eigenvalue is equal to =285120=.

#+BEGIN_SRC sage :exports none
  f18_17_5_0 = dict_sum((-27411940570812415758258813595452421519092205, 426844081323506188348315458383164538880, 1108258366195376623065993820933390921728), S18_17_5.basis)
#+END_SRC

#+RESULTS:

The euler factor of the spinor L function at =2= is given as follows.

#+BEGIN_SRC sage :exports results
  spinor_l_euler_factor(2, f18_17_5_0).factor()
#+END_SRC

#+RESULTS:
: (-1 + 131072*t)^2 * (1 + 75520*t + 17179869184*t^2) * (1 - 98496*t - 3084910592*t^2 - 1692148395147264*t^3 + 295147905179352825856*t^4)

This satisfies conjecture 7.7 (i) at 2 for =f= of weight =16=, =g= of weight =20= and =h= of weight =16=.

#+BEGIN_SRC sage :exports none
  K18_17_5 = NumberField(x^2 - 122112*x - 6040977408, names="a")
#+END_SRC

#+RESULTS:

Let =a= be a root of =x^2 - 122112*x - 6040977408=. And let F1= (115755188162636478306143242492773391279012500590415297895*a - 280871869782212043390032985770730420043620758653959144573711360) * Theta0 + (-3520271549093870111699822711292893500461035796234240*a + 1792446151032915388102568677460511010394423622703062712320) * Theta1 + (-23730541121480814714846359164016657918248298142879744*a + 8813953574896657677285798006856812369943698972051863764992) * Theta2=.
Then =F1= is an eigenform whose eigenvalue is equal to =a=.

#+BEGIN_SRC sage :exports none
  f18_17_5_1 = dict_sum((115755188162636478306143242492773391279012500590415297895*K18_17_5.gen() - 280871869782212043390032985770730420043620758653959144573711360, -3520271549093870111699822711292893500461035796234240*K18_17_5.gen() + 1792446151032915388102568677460511010394423622703062712320, -23730541121480814714846359164016657918248298142879744*K18_17_5.gen() + 8813953574896657677285798006856812369943698972051863764992), S18_17_5.basis)
#+END_SRC

#+RESULTS:

The euler factor of the spinor L function at =2= is given as follows.
#+BEGIN_SRC sage :exports results
  spinor_l_euler_factor(2, f18_17_5_1).factor()
#+END_SRC

#+RESULTS:
: (1 - 131072*t)^2 * (1 + (-a + 262144)*t + (-36352*a + 24053547008)*t^2 + (8824815616*a + 1010090408673280)*t^3 + (-624522604576768*a + 413236791008634601472)*t^4 + (-295147905179352825856*a + 77371252455336267181195264)*t^5 + 5070602400912917605986812821504*t^6)


* Congruence
Fourier coefficients and Hecke eigenvalues of =F0= and =670 * F1= are congruent modulo a prime ideal over =757=.

#+BEGIN_SRC sage :exports none
  def _check_cong_at(t):
      return all(modulo_p(a, 757, 285120) == modulo_p(b * 670, 757, 285120) for a, b in
                 zip(f18_17_5_0[t].vector, f18_17_5_1[t].vector))

  all(_check_cong_at(t) for t in f18_17_5_0)
#+END_SRC

#+RESULTS:
: True
